const config = {
  1: { title: '特价促销', info: '爆款限时特价' },
  2: { title: '直降促销', info: '大牌商品最高直降$元' },
  3: { title: '满量减', info: '大牌商品最高减$元' },
  4: { title: '折扣促销', info: '大牌商品低至$折' },
  5: { title: '满量折', info: '大牌商品低至$折' },
  6: { title: '满额减', info: '大牌商品最高减$元' },
  7: { title: '满额折', info: '大牌商品低至$折' },
  8: { title: '赠商品', info: '满$元即有机会获赠商品' },
  9: { title: '赠优惠券', info: '价值$元优惠券免费领取' },
  10: { title: '多件促销', info: '任选$件商品，$折起！' },
  11: { title: '组合促销', info: '任选$件商品，仅需$元！' },
  12: { title: '秒杀', info: '今日大牌秒杀' },
  13: { title: '拼团专场', info: '大牌拼团直降$元' },
  14: { title: '满额换购', info: '满99元即可换购以下商品' },
  15: { title: '买商品换购', info: '购买指定商品即可换购以下商品' },
  16: { title: '预售', info: '大牌新品火爆预售' },
  17: { title: '0元试用', info: '新品抢先试用' },
  18: { title: '套餐', info: '超级搭配套餐' },
  19: { title: '砍价', info: '砍一砍，免费拿' },
}

export default config
