/*
 * @Author: LeeJiancong
 * @Date: 2020-07-22 09:54:50
 * @LastEditors: LeeJiancong
 * @LastEditTime: 2020-07-30 19:28:23
 */
/**
 * 正则表达式集合
 */

export const PATTERN_MAPS = {
  // 8-20位， 大小写字幕 + 数字组合
  password: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?!.*\s).{8,20}$/,
  email: /^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
  phone: /^1[3|4|5|6|7|8|9][0-9]{9}$/,
  phoneAndEmail: /^(1[3|4|5|6|7|8|9][0-9]{9})|([\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+)$/,
  tel: /^((0\d{2,3})-)?(\d{7,8})(-(\d{3,}))?$/, //座机
  smsCode: /^\d{6}$/,
  money: /^\d*(?:\.\d{0,2})?$/,
  weight: /^\d*(?:\.\d{0,3})?$/,
  quantity: /^[1-9]+[0-9]*$/, // 数量，大于等于1的正整数
  identity: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/, // 数量，大于等于1的正整数
  link: /^(https?|ftp):\/\/(?:www\.)?[a-zA-Z0-9-]+(?:\.[a-zA-Z]{2,})+(?:\/[^\s?#]*)?(?:\?[^\s#]*)?(?:#[^\s]*)?$/, // 链接
}

export const TIPS_TEMPLATE_MAPS = ['请输入', '请填写正确的数据']
