/**
 * 正则表达式集合
 */
export const PATTERN_MAPS = {
  // password: /^(?=.*[a-z])(?=.*[A-Z])[a-zA-Z\d]{8,20}$/, // 8-20位， 大小写字幕 + 数字组合
  password: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{8,20}$/, // 8-20位， 大小写字幕 + 数字组合
  email: /^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
  phone: /^1[3|4|5|6|7|8|9][0-9]{9}$/,
  phoneAndEmail: /^(1[3|4|5|6|7|8|9][0-9]{9})|([\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+)$/,
  tel: /^((0\d{2,3})-)?(\d{7,8})(-(\d{3,}))?$/, // 座机
  smsCode: /^\d{6}$/,
  money: /^\d*(?:\.\d{0,2})?$/,
  weight: /^\d*(?:\.\d{0,3})?$/,
  quantity: /^[1-9]+[0-9]*$/, // 数量，大于等于1的正整数
}
